SET SCHEMA "public";

INSERT INTO "ratings" ("name")
VALUES
    ('G'),
    ('PG'),
    ('PG-13'),
    ('R'),
    ('NC-17');

INSERT INTO "genres" ("name")
VALUES
    ('Комедия'),
    ('Драма'),
    ('Мультфильм'),
    ('Триллер'),
    ('Документальный'),
    ('Боевик');

INSERT INTO "films" ("name", "description", "release_date", "duration", "rating_id")
VALUES
    ('Пушистые кошаки', 'Отряд пушистиков спасает мир', '2024-10-10', '90', '2'),
    ('Звездные баталии', 'Пародия на звездные войны', '2025-09-28', '72', '4'),
    ('Мертвый бассейн', 'Веселый наемник кромсает людей', '2026-01-01', '103', '5'),
    ('Постучись в мою палату', 'Когда от любви срывает башню', '2023-05-04', '83', '4'),
    ('Три богатыря', 'Мультик для детей', '2012-07-15', '78', '1'),
    ('Иван Васильевич вновь меняет профессию', 'В этот раз Царю предстоит стать разработчиком', '2027-03-02', '91', '2'),
    ('Братский брат', 'Брат за брата вступает в братский конфликт', '2040-08-25', '78', '5'),
    ('Астрал 666', 'Очередной фильм франшизы, когда это уже закончится', '2099-02-13', '130', '5'),
    ('Отомстители', 'Команда супергероев с земли спасают всю вселенную с помощью паутины', '2025-06-10', '144', '3');

INSERT INTO "film_genres" ("film_id", "genre_id")
VALUES
    ('1', '1'),
    ('1', '1'),
    ('2', '2'),
    ('3', '2'),
    ('3', '5'),
    ('4', '3'),
    ('4', '6'),
    ('5', '5'),
    ('6', '1'),
    ('7', '2'),
    ('7', '3'),
    ('8', '3'),
    ('9', '4'),
    ('9', '2');

INSERT INTO "users" ("email", "login", "name", "birthday")
VALUES
    ('fil@ya.ru','fil','Filipp','1995-05-06'),
    ('evgesha@ya.ru','evgesha','Евгения','2000-02-09'),
    ('artem@ya.ru','temich','Artem','1997-10-30'),
    ('lolosha@ya.ru','loloha','bezimeni','2010-01-14'),
    ('kuskus@ya.ru','Kate','Ekaterina','2002-10-19'),
    ('vovka@ya.ru','vovanich','Вова','1999-09-09'),
    ('pro100doter@ya.ru','pro100','Oleg','2001-02-06'),
    ('lorik@ya.ru','lorik','Лариса','1997-09-03'),
    ('mihan@ya.ru','mihan','Mihail','1994-08-15'),
    ('toshka@ya.ru','toshka','Anatoliy','1990-11-07'),
    ('miracle@ya.ru','miracle','Danya','2003-03-27');


INSERT INTO "director" ("name")
VALUES
    ('Filipp'),
    ('Artem'),
    ('bezimeni'),
    ('Mihail');
